tests/DiscoveryLookupPort_probe.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery"    
    xmlns:onvif="http://www.onvif.org/ver10/network/wsdl">
  <soap:Header>
      <wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
      <wsa:Action>http://www.onvif.org/ver10/network/wsdl/Probe</wsa:Action>
      <wsa:MessageID>urn:uuid:29cf10da-5c41-4d55-b184-5ee15e38ce23</wsa:MessageID>
  </soap:Header>
  <soap:Body>
      <onvif:Probe>
	<wsd:Types>onvif:NetworkVideoTransmitter</wsd:Types>
      </onvif:Probe>
  </soap:Body>
</soap:Envelope> 